Revit 2026 API

# BendingDetailBendDiameterDimensionType Enumeration

---

Describes the dimension type for bend diameter.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BendingDetailBendDiameterDimensionType
```
```vb
Public Enumeration BendingDetailBendDiameterDimensionType
```
```cpp
public enum class BendingDetailBendDiameterDimensionType
```
```fsharp
type BendingDetailBendDiameterDimensionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Diameter | 1 | Diameter Dimension Type |
| Radial | 0 | Radial Dimension Type |

#### Reference

Autodesk.Revit.DB.Structure Namespace